#ifndef __REVISION_H__
#define __REVISION_H__

/*********************************************
*  新版本号：1.0.0.0
*  旧版本号：无
*  修改者：shaowei.chen
*  提交时间：2012-12-24
*  修改原因：第一个版本
*  修改内容：
**********************************************/
/*********************************************
*  新版本号：1.0.0.1
*  旧版本号：1.0.0.0
*  修改者：shaowei.chen
*  提交时间：2013-04-27
*  修改原因：使用网上找的铃声文件
*  修改内容：
**********************************************/
/*********************************************
*  新版本号：1.0.0.2
*  旧版本号：1.0.0.1
*  修改者：shaowei.chen
*  提交时间：2013-04-27
*  修改原因：使用网上找的铃声文件
*  修改内容：
**********************************************/
/*********************************************
*  新版本号：1.0.0.3
*  旧版本号：1.0.0.2
*  修改者：shaowei.chen
*  提交时间：2013-07-19
*  修改原因：使用标准电话铃声并命名为Ring1.wav-Ring10.wav
*  修改内容：
**********************************************/
/*********************************************
*  新版本号：1.0.0.4
*  旧版本号：1.0.0.3
*  修改者：shaowei.chen
*  提交时间：2013-07-24
*  修改原因：去掉Ring10.wav
*  修改内容：
**********************************************/
/*********************************************
*  新版本号：1.0.0.5
*  旧版本号：1.0.0.4
*  修改者：shaowei.chen
*  提交时间：2013-11-08
*  修改原因：增加BELLCORE dr1-dr5
*  修改内容：
**********************************************/
/*********************************************
*  新版本号：1.145.0.6
*  旧版本号：1.0.0.5
*  修改者：Will
*  提交时间：2015-2-4
*  修改原因：WILDIX客户版本修改了Ring1.wav
*  修改内容：
**********************************************/
/*********************************************
*  新版本号：1.145.0.7
*  旧版本号：1.145.0.6
*  修改者：Will
*  提交时间：2015-2-4
*  修改原因：空间不够，去掉其他WILDIX不需要的铃声文件
*  修改内容：
**********************************************/
#define MOD_VERSION  "1.145.0.7" 

#define MOD_NAME    "rings"




#ifdef __cplusplus
extern "C" {
#endif




#ifdef __cplusplus
}
#endif

#endif
