#ifndef __REVISION_H__
#define __REVISION_H__

/*********************************************
*  新版本号：1.0.0.0
*  旧版本号：无
*  修改者：shaowei.chen
*  提交时间：2012-12-24
*  修改原因：第一个版本
*  修改内容：
**********************************************/
/*********************************************
*  新版本号：1.0.0.1
*  旧版本号：1.0.0.0
*  修改者：shaowei.chen
*  提交时间：2013-04-27
*  修改原因：使用网上找的铃声文件
*  修改内容：
**********************************************/
/*********************************************
*  新版本号：1.0.0.2
*  旧版本号：1.0.0.1
*  修改者：shaowei.chen
*  提交时间：2013-04-27
*  修改原因：使用网上找的铃声文件
*  修改内容：
**********************************************/
/*********************************************
*  新版本号：1.0.0.3
*  旧版本号：1.0.0.2
*  修改者：shaowei.chen
*  提交时间：2013-07-19
*  修改原因：使用标准电话铃声并命名为Ring1.wav-Ring10.wav
*  修改内容：
**********************************************/
/*********************************************
*  新版本号：1.0.0.4
*  旧版本号：1.0.0.3
*  修改者：shaowei.chen
*  提交时间：2013-07-24
*  修改原因：去掉Ring10.wav
*  修改内容：
**********************************************/
/*********************************************
*  新版本号：1.0.0.5
*  旧版本号：1.0.0.4
*  修改者：shaowei.chen
*  提交时间：2013-11-08
*  修改原因：增加BELLCORE dr1-dr5
*  修改内容：
**********************************************/
/*********************************************
* New version : 1.0.0.6
* Old version : 1.0.0.5
*  Author	   ：Oliver/Linky
*  CommitType  : 需求
*  Date		   ：2016/06/23
*  Reason：	   :  2721 【Intertel】实现支持music on hold功能
*  Modified    : 1、增加默认Local music on hold铃声；
*  Issue	   : zentao task#2721
*  Affected	   : ring
**********************************************/
#define MOD_VERSION  "1.0.0.6" 

#define MOD_NAME    "rings"




#ifdef __cplusplus
extern "C" {
#endif




#ifdef __cplusplus
}
#endif

#endif
